{
  "metadata": {
    "total_size": 35279374848
  },
  "weight_map": {
    "lm_head.weight": "model-00008-of-00008.safetensors",
    "model.embed_tokens.weight": "model-00001-of-00008.safetensors",
    "model.layers.0.input_layernorm.weight": "model-00001-of-00008.safetensors",
    "model.layers.0.mlp.language_mlp.down_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.0.mlp.language_mlp.gate_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.0.mlp.language_mlp.up_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.0.mlp.vision_mlp.down_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.0.mlp.vision_mlp.gate_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.0.mlp.vision_mlp.up_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.0.post_attention_layernorm.weight": "model-00001-of-00008.safetensors",
    "model.layers.0.self_attn.language_expert_dense.weight": "model-00001-of-00008.safetensors",
    "model.layers.0.self_attn.language_expert_query_key_value.weight": "model-00001-of-00008.safetensors",
    "model.layers.0.self_attn.rotary_emb.inv_freq": "model-00001-of-00008.safetensors",
    "model.layers.0.self_attn.vision_expert_dense.weight": "model-00001-of-00008.safetensors",
    "model.layers.0.self_attn.vision_expert_query_key_value.weight": "model-00001-of-00008.safetensors",
    "model.layers.1.input_layernorm.weight": "model-00001-of-00008.safetensors",
    "model.layers.1.mlp.language_mlp.down_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.1.mlp.language_mlp.gate_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.1.mlp.language_mlp.up_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.1.mlp.vision_mlp.down_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.1.mlp.vision_mlp.gate_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.1.mlp.vision_mlp.up_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.1.post_attention_layernorm.weight": "model-00001-of-00008.safetensors",
    "model.layers.1.self_attn.language_expert_dense.weight": "model-00001-of-00008.safetensors",
    "model.layers.1.self_attn.language_expert_query_key_value.weight": "model-00001-of-00008.safetensors",
    "model.layers.1.self_attn.rotary_emb.inv_freq": "model-00001-of-00008.safetensors",
    "model.layers.1.self_attn.vision_expert_dense.weight": "model-00001-of-00008.safetensors",
    "model.layers.1.self_attn.vision_expert_query_key_value.weight": "model-00001-of-00008.safetensors",
    "model.layers.10.input_layernorm.weight": "model-00002-of-00008.safetensors",
    "model.layers.10.mlp.language_mlp.down_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.10.mlp.language_mlp.gate_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.10.mlp.language_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.10.mlp.vision_mlp.down_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.10.mlp.vision_mlp.gate_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.10.mlp.vision_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.10.post_attention_layernorm.weight": "model-00002-of-00008.safetensors",
    "model.layers.10.self_attn.language_expert_dense.weight": "model-00002-of-00008.safetensors",
    "model.layers.10.self_attn.language_expert_query_key_value.weight": "model-00002-of-00008.safetensors",
    "model.layers.10.self_attn.rotary_emb.inv_freq": "model-00002-of-00008.safetensors",
    "model.layers.10.self_attn.vision_expert_dense.weight": "model-00002-of-00008.safetensors",
    "model.layers.10.self_attn.vision_expert_query_key_value.weight": "model-00002-of-00008.safetensors",
    "model.layers.11.input_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.11.mlp.language_mlp.down_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.11.mlp.language_mlp.gate_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.11.mlp.language_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.11.mlp.vision_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.11.mlp.vision_mlp.gate_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.11.mlp.vision_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.11.post_attention_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.11.self_attn.language_expert_dense.weight": "model-00002-of-00008.safetensors",
    "model.layers.11.self_attn.language_expert_query_key_value.weight": "model-00002-of-00008.safetensors",
    "model.layers.11.self_attn.rotary_emb.inv_freq": "model-00002-of-00008.safetensors",
    "model.layers.11.self_attn.vision_expert_dense.weight": "model-00002-of-00008.safetensors",
    "model.layers.11.self_attn.vision_expert_query_key_value.weight": "model-00002-of-00008.safetensors",
    "model.layers.12.input_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.12.mlp.language_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.12.mlp.language_mlp.gate_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.12.mlp.language_mlp.up_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.12.mlp.vision_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.12.mlp.vision_mlp.gate_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.12.mlp.vision_mlp.up_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.12.post_attention_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.12.self_attn.language_expert_dense.weight": "model-00003-of-00008.safetensors",
    "model.layers.12.self_attn.language_expert_query_key_value.weight": "model-00003-of-00008.safetensors",
    "model.layers.12.self_attn.rotary_emb.inv_freq": "model-00003-of-00008.safetensors",
    "model.layers.12.self_attn.vision_expert_dense.weight": "model-00003-of-00008.safetensors",
    "model.layers.12.self_attn.vision_expert_query_key_value.weight": "model-00003-of-00008.safetensors",
    "model.layers.13.input_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.13.mlp.language_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.13.mlp.language_mlp.gate_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.13.mlp.language_mlp.up_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.13.mlp.vision_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.13.mlp.vision_mlp.gate_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.13.mlp.vision_mlp.up_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.13.post_attention_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.13.self_attn.language_expert_dense.weight": "model-00003-of-00008.safetensors",
    "model.layers.13.self_attn.language_expert_query_key_value.weight": "model-00003-of-00008.safetensors",
    "model.layers.13.self_attn.rotary_emb.inv_freq": "model-00003-of-00008.safetensors",
    "model.layers.13.self_attn.vision_expert_dense.weight": "model-00003-of-00008.safetensors",
    "model.layers.13.self_attn.vision_expert_query_key_value.weight": "model-00003-of-00008.safetensors",
    "model.layers.14.input_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.14.mlp.language_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.14.mlp.language_mlp.gate_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.14.mlp.language_mlp.up_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.14.mlp.vision_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.14.mlp.vision_mlp.gate_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.14.mlp.vision_mlp.up_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.14.post_attention_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.14.self_attn.language_expert_dense.weight": "model-00003-of-00008.safetensors",
    "model.layers.14.self_attn.language_expert_query_key_value.weight": "model-00003-of-00008.safetensors",
    "model.layers.14.self_attn.rotary_emb.inv_freq": "model-00003-of-00008.safetensors",
    "model.layers.14.self_attn.vision_expert_dense.weight": "model-00003-of-00008.safetensors",
    "model.layers.14.self_attn.vision_expert_query_key_value.weight": "model-00003-of-00008.safetensors",
    "model.layers.15.input_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.15.mlp.language_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.15.mlp.language_mlp.gate_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.15.mlp.language_mlp.up_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.15.mlp.vision_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.15.mlp.vision_mlp.gate_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.15.mlp.vision_mlp.up_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.15.post_attention_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.15.self_attn.language_expert_dense.weight": "model-00003-of-00008.safetensors",
    "model.layers.15.self_attn.language_expert_query_key_value.weight": "model-00003-of-00008.safetensors",
    "model.layers.15.self_attn.rotary_emb.inv_freq": "model-00003-of-00008.safetensors",
    "model.layers.15.self_attn.vision_expert_dense.weight": "model-00003-of-00008.safetensors",
    "model.layers.15.self_attn.vision_expert_query_key_value.weight": "model-00003-of-00008.safetensors",
    "model.layers.16.input_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.16.mlp.language_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.16.mlp.language_mlp.gate_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.16.mlp.language_mlp.up_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.16.mlp.vision_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.16.mlp.vision_mlp.gate_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.16.mlp.vision_mlp.up_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.16.post_attention_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.16.self_attn.language_expert_dense.weight": "model-00003-of-00008.safetensors",
    "model.layers.16.self_attn.language_expert_query_key_value.weight": "model-00003-of-00008.safetensors",
    "model.layers.16.self_attn.rotary_emb.inv_freq": "model-00003-of-00008.safetensors",
    "model.layers.16.self_attn.vision_expert_dense.weight": "model-00003-of-00008.safetensors",
    "model.layers.16.self_attn.vision_expert_query_key_value.weight": "model-00003-of-00008.safetensors",
    "model.layers.17.input_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.17.mlp.language_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.17.mlp.language_mlp.gate_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.17.mlp.language_mlp.up_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.17.mlp.vision_mlp.down_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.17.mlp.vision_mlp.gate_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.17.mlp.vision_mlp.up_proj.weight": "model-00003-of-00008.safetensors",
    "model.layers.17.post_attention_layernorm.weight": "model-00003-of-00008.safetensors",
    "model.layers.17.self_attn.language_expert_dense.weight": "model-00003-of-00008.safetensors",
    "model.layers.17.self_attn.language_expert_query_key_value.weight": "model-00003-of-00008.safetensors",
    "model.layers.17.self_attn.rotary_emb.inv_freq": "model-00003-of-00008.safetensors",
    "model.layers.17.self_attn.vision_expert_dense.weight": "model-00003-of-00008.safetensors",
    "model.layers.17.self_attn.vision_expert_query_key_value.weight": "model-00003-of-00008.safetensors",
    "model.layers.18.input_layernorm.weight": "model-00004-of-00008.safetensors",
    "model.layers.18.mlp.language_mlp.down_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.18.mlp.language_mlp.gate_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.18.mlp.language_mlp.up_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.18.mlp.vision_mlp.down_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.18.mlp.vision_mlp.gate_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.18.mlp.vision_mlp.up_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.18.post_attention_layernorm.weight": "model-00004-of-00008.safetensors",
    "model.layers.18.self_attn.language_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.18.self_attn.language_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.18.self_attn.rotary_emb.inv_freq": "model-00003-of-00008.safetensors",
    "model.layers.18.self_attn.vision_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.18.self_attn.vision_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.19.input_layernorm.weight": "model-00004-of-00008.safetensors",
    "model.layers.19.mlp.language_mlp.down_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.19.mlp.language_mlp.gate_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.19.mlp.language_mlp.up_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.19.mlp.vision_mlp.down_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.19.mlp.vision_mlp.gate_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.19.mlp.vision_mlp.up_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.19.post_attention_layernorm.weight": "model-00004-of-00008.safetensors",
    "model.layers.19.self_attn.language_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.19.self_attn.language_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.19.self_attn.rotary_emb.inv_freq": "model-00004-of-00008.safetensors",
    "model.layers.19.self_attn.vision_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.19.self_attn.vision_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.2.input_layernorm.weight": "model-00001-of-00008.safetensors",
    "model.layers.2.mlp.language_mlp.down_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.2.mlp.language_mlp.gate_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.2.mlp.language_mlp.up_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.2.mlp.vision_mlp.down_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.2.mlp.vision_mlp.gate_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.2.mlp.vision_mlp.up_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.2.post_attention_layernorm.weight": "model-00001-of-00008.safetensors",
    "model.layers.2.self_attn.language_expert_dense.weight": "model-00001-of-00008.safetensors",
    "model.layers.2.self_attn.language_expert_query_key_value.weight": "model-00001-of-00008.safetensors",
    "model.layers.2.self_attn.rotary_emb.inv_freq": "model-00001-of-00008.safetensors",
    "model.layers.2.self_attn.vision_expert_dense.weight": "model-00001-of-00008.safetensors",
    "model.layers.2.self_attn.vision_expert_query_key_value.weight": "model-00001-of-00008.safetensors",
    "model.layers.20.input_layernorm.weight": "model-00004-of-00008.safetensors",
    "model.layers.20.mlp.language_mlp.down_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.20.mlp.language_mlp.gate_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.20.mlp.language_mlp.up_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.20.mlp.vision_mlp.down_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.20.mlp.vision_mlp.gate_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.20.mlp.vision_mlp.up_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.20.post_attention_layernorm.weight": "model-00004-of-00008.safetensors",
    "model.layers.20.self_attn.language_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.20.self_attn.language_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.20.self_attn.rotary_emb.inv_freq": "model-00004-of-00008.safetensors",
    "model.layers.20.self_attn.vision_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.20.self_attn.vision_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.21.input_layernorm.weight": "model-00004-of-00008.safetensors",
    "model.layers.21.mlp.language_mlp.down_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.21.mlp.language_mlp.gate_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.21.mlp.language_mlp.up_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.21.mlp.vision_mlp.down_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.21.mlp.vision_mlp.gate_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.21.mlp.vision_mlp.up_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.21.post_attention_layernorm.weight": "model-00004-of-00008.safetensors",
    "model.layers.21.self_attn.language_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.21.self_attn.language_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.21.self_attn.rotary_emb.inv_freq": "model-00004-of-00008.safetensors",
    "model.layers.21.self_attn.vision_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.21.self_attn.vision_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.22.input_layernorm.weight": "model-00004-of-00008.safetensors",
    "model.layers.22.mlp.language_mlp.down_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.22.mlp.language_mlp.gate_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.22.mlp.language_mlp.up_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.22.mlp.vision_mlp.down_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.22.mlp.vision_mlp.gate_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.22.mlp.vision_mlp.up_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.22.post_attention_layernorm.weight": "model-00004-of-00008.safetensors",
    "model.layers.22.self_attn.language_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.22.self_attn.language_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.22.self_attn.rotary_emb.inv_freq": "model-00004-of-00008.safetensors",
    "model.layers.22.self_attn.vision_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.22.self_attn.vision_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.23.input_layernorm.weight": "model-00004-of-00008.safetensors",
    "model.layers.23.mlp.language_mlp.down_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.23.mlp.language_mlp.gate_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.23.mlp.language_mlp.up_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.23.mlp.vision_mlp.down_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.23.mlp.vision_mlp.gate_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.23.mlp.vision_mlp.up_proj.weight": "model-00004-of-00008.safetensors",
    "model.layers.23.post_attention_layernorm.weight": "model-00004-of-00008.safetensors",
    "model.layers.23.self_attn.language_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.23.self_attn.language_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.23.self_attn.rotary_emb.inv_freq": "model-00004-of-00008.safetensors",
    "model.layers.23.self_attn.vision_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.23.self_attn.vision_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.24.input_layernorm.weight": "model-00005-of-00008.safetensors",
    "model.layers.24.mlp.language_mlp.down_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.24.mlp.language_mlp.gate_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.24.mlp.language_mlp.up_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.24.mlp.vision_mlp.down_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.24.mlp.vision_mlp.gate_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.24.mlp.vision_mlp.up_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.24.post_attention_layernorm.weight": "model-00005-of-00008.safetensors",
    "model.layers.24.self_attn.language_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.24.self_attn.language_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.24.self_attn.rotary_emb.inv_freq": "model-00004-of-00008.safetensors",
    "model.layers.24.self_attn.vision_expert_dense.weight": "model-00004-of-00008.safetensors",
    "model.layers.24.self_attn.vision_expert_query_key_value.weight": "model-00004-of-00008.safetensors",
    "model.layers.25.input_layernorm.weight": "model-00005-of-00008.safetensors",
    "model.layers.25.mlp.language_mlp.down_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.25.mlp.language_mlp.gate_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.25.mlp.language_mlp.up_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.25.mlp.vision_mlp.down_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.25.mlp.vision_mlp.gate_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.25.mlp.vision_mlp.up_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.25.post_attention_layernorm.weight": "model-00005-of-00008.safetensors",
    "model.layers.25.self_attn.language_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.25.self_attn.language_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.25.self_attn.rotary_emb.inv_freq": "model-00005-of-00008.safetensors",
    "model.layers.25.self_attn.vision_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.25.self_attn.vision_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.26.input_layernorm.weight": "model-00005-of-00008.safetensors",
    "model.layers.26.mlp.language_mlp.down_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.26.mlp.language_mlp.gate_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.26.mlp.language_mlp.up_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.26.mlp.vision_mlp.down_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.26.mlp.vision_mlp.gate_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.26.mlp.vision_mlp.up_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.26.post_attention_layernorm.weight": "model-00005-of-00008.safetensors",
    "model.layers.26.self_attn.language_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.26.self_attn.language_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.26.self_attn.rotary_emb.inv_freq": "model-00005-of-00008.safetensors",
    "model.layers.26.self_attn.vision_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.26.self_attn.vision_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.27.input_layernorm.weight": "model-00005-of-00008.safetensors",
    "model.layers.27.mlp.language_mlp.down_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.27.mlp.language_mlp.gate_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.27.mlp.language_mlp.up_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.27.mlp.vision_mlp.down_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.27.mlp.vision_mlp.gate_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.27.mlp.vision_mlp.up_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.27.post_attention_layernorm.weight": "model-00005-of-00008.safetensors",
    "model.layers.27.self_attn.language_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.27.self_attn.language_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.27.self_attn.rotary_emb.inv_freq": "model-00005-of-00008.safetensors",
    "model.layers.27.self_attn.vision_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.27.self_attn.vision_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.28.input_layernorm.weight": "model-00005-of-00008.safetensors",
    "model.layers.28.mlp.language_mlp.down_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.28.mlp.language_mlp.gate_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.28.mlp.language_mlp.up_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.28.mlp.vision_mlp.down_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.28.mlp.vision_mlp.gate_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.28.mlp.vision_mlp.up_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.28.post_attention_layernorm.weight": "model-00005-of-00008.safetensors",
    "model.layers.28.self_attn.language_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.28.self_attn.language_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.28.self_attn.rotary_emb.inv_freq": "model-00005-of-00008.safetensors",
    "model.layers.28.self_attn.vision_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.28.self_attn.vision_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.29.input_layernorm.weight": "model-00005-of-00008.safetensors",
    "model.layers.29.mlp.language_mlp.down_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.29.mlp.language_mlp.gate_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.29.mlp.language_mlp.up_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.29.mlp.vision_mlp.down_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.29.mlp.vision_mlp.gate_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.29.mlp.vision_mlp.up_proj.weight": "model-00005-of-00008.safetensors",
    "model.layers.29.post_attention_layernorm.weight": "model-00005-of-00008.safetensors",
    "model.layers.29.self_attn.language_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.29.self_attn.language_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.29.self_attn.rotary_emb.inv_freq": "model-00005-of-00008.safetensors",
    "model.layers.29.self_attn.vision_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.29.self_attn.vision_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.3.input_layernorm.weight": "model-00001-of-00008.safetensors",
    "model.layers.3.mlp.language_mlp.down_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.3.mlp.language_mlp.gate_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.3.mlp.language_mlp.up_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.3.mlp.vision_mlp.down_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.3.mlp.vision_mlp.gate_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.3.mlp.vision_mlp.up_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.3.post_attention_layernorm.weight": "model-00001-of-00008.safetensors",
    "model.layers.3.self_attn.language_expert_dense.weight": "model-00001-of-00008.safetensors",
    "model.layers.3.self_attn.language_expert_query_key_value.weight": "model-00001-of-00008.safetensors",
    "model.layers.3.self_attn.rotary_emb.inv_freq": "model-00001-of-00008.safetensors",
    "model.layers.3.self_attn.vision_expert_dense.weight": "model-00001-of-00008.safetensors",
    "model.layers.3.self_attn.vision_expert_query_key_value.weight": "model-00001-of-00008.safetensors",
    "model.layers.30.input_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.layers.30.mlp.language_mlp.down_proj.weight": "model-00006-of-00008.safetensors",
    "model.layers.30.mlp.language_mlp.gate_proj.weight": "model-00006-of-00008.safetensors",
    "model.layers.30.mlp.language_mlp.up_proj.weight": "model-00006-of-00008.safetensors",
    "model.layers.30.mlp.vision_mlp.down_proj.weight": "model-00006-of-00008.safetensors",
    "model.layers.30.mlp.vision_mlp.gate_proj.weight": "model-00006-of-00008.safetensors",
    "model.layers.30.mlp.vision_mlp.up_proj.weight": "model-00006-of-00008.safetensors",
    "model.layers.30.post_attention_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.layers.30.self_attn.language_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.30.self_attn.language_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.30.self_attn.rotary_emb.inv_freq": "model-00005-of-00008.safetensors",
    "model.layers.30.self_attn.vision_expert_dense.weight": "model-00005-of-00008.safetensors",
    "model.layers.30.self_attn.vision_expert_query_key_value.weight": "model-00005-of-00008.safetensors",
    "model.layers.31.input_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.layers.31.mlp.language_mlp.down_proj.weight": "model-00006-of-00008.safetensors",
    "model.layers.31.mlp.language_mlp.gate_proj.weight": "model-00006-of-00008.safetensors",
    "model.layers.31.mlp.language_mlp.up_proj.weight": "model-00006-of-00008.safetensors",
    "model.layers.31.mlp.vision_mlp.down_proj.weight": "model-00006-of-00008.safetensors",
    "model.layers.31.mlp.vision_mlp.gate_proj.weight": "model-00006-of-00008.safetensors",
    "model.layers.31.mlp.vision_mlp.up_proj.weight": "model-00006-of-00008.safetensors",
    "model.layers.31.post_attention_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.layers.31.self_attn.language_expert_dense.weight": "model-00006-of-00008.safetensors",
    "model.layers.31.self_attn.language_expert_query_key_value.weight": "model-00006-of-00008.safetensors",
    "model.layers.31.self_attn.rotary_emb.inv_freq": "model-00006-of-00008.safetensors",
    "model.layers.31.self_attn.vision_expert_dense.weight": "model-00006-of-00008.safetensors",
    "model.layers.31.self_attn.vision_expert_query_key_value.weight": "model-00006-of-00008.safetensors",
    "model.layers.4.input_layernorm.weight": "model-00001-of-00008.safetensors",
    "model.layers.4.mlp.language_mlp.down_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.4.mlp.language_mlp.gate_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.4.mlp.language_mlp.up_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.4.mlp.vision_mlp.down_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.4.mlp.vision_mlp.gate_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.4.mlp.vision_mlp.up_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.4.post_attention_layernorm.weight": "model-00001-of-00008.safetensors",
    "model.layers.4.self_attn.language_expert_dense.weight": "model-00001-of-00008.safetensors",
    "model.layers.4.self_attn.language_expert_query_key_value.weight": "model-00001-of-00008.safetensors",
    "model.layers.4.self_attn.rotary_emb.inv_freq": "model-00001-of-00008.safetensors",
    "model.layers.4.self_attn.vision_expert_dense.weight": "model-00001-of-00008.safetensors",
    "model.layers.4.self_attn.vision_expert_query_key_value.weight": "model-00001-of-00008.safetensors",
    "model.layers.5.input_layernorm.weight": "model-00002-of-00008.safetensors",
    "model.layers.5.mlp.language_mlp.down_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.5.mlp.language_mlp.gate_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.5.mlp.language_mlp.up_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.5.mlp.vision_mlp.down_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.5.mlp.vision_mlp.gate_proj.weight": "model-00001-of-00008.safetensors",
    "model.layers.5.mlp.vision_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.5.post_attention_layernorm.weight": "model-00002-of-00008.safetensors",
    "model.layers.5.self_attn.language_expert_dense.weight": "model-00001-of-00008.safetensors",
    "model.layers.5.self_attn.language_expert_query_key_value.weight": "model-00001-of-00008.safetensors",
    "model.layers.5.self_attn.rotary_emb.inv_freq": "model-00001-of-00008.safetensors",
    "model.layers.5.self_attn.vision_expert_dense.weight": "model-00001-of-00008.safetensors",
    "model.layers.5.self_attn.vision_expert_query_key_value.weight": "model-00001-of-00008.safetensors",
    "model.layers.6.input_layernorm.weight": "model-00002-of-00008.safetensors",
    "model.layers.6.mlp.language_mlp.down_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.6.mlp.language_mlp.gate_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.6.mlp.language_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.6.mlp.vision_mlp.down_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.6.mlp.vision_mlp.gate_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.6.mlp.vision_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.6.post_attention_layernorm.weight": "model-00002-of-00008.safetensors",
    "model.layers.6.self_attn.language_expert_dense.weight": "model-00002-of-00008.safetensors",
    "model.layers.6.self_attn.language_expert_query_key_value.weight": "model-00002-of-00008.safetensors",
    "model.layers.6.self_attn.rotary_emb.inv_freq": "model-00002-of-00008.safetensors",
    "model.layers.6.self_attn.vision_expert_dense.weight": "model-00002-of-00008.safetensors",
    "model.layers.6.self_attn.vision_expert_query_key_value.weight": "model-00002-of-00008.safetensors",
    "model.layers.7.input_layernorm.weight": "model-00002-of-00008.safetensors",
    "model.layers.7.mlp.language_mlp.down_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.7.mlp.language_mlp.gate_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.7.mlp.language_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.7.mlp.vision_mlp.down_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.7.mlp.vision_mlp.gate_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.7.mlp.vision_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.7.post_attention_layernorm.weight": "model-00002-of-00008.safetensors",
    "model.layers.7.self_attn.language_expert_dense.weight": "model-00002-of-00008.safetensors",
    "model.layers.7.self_attn.language_expert_query_key_value.weight": "model-00002-of-00008.safetensors",
    "model.layers.7.self_attn.rotary_emb.inv_freq": "model-00002-of-00008.safetensors",
    "model.layers.7.self_attn.vision_expert_dense.weight": "model-00002-of-00008.safetensors",
    "model.layers.7.self_attn.vision_expert_query_key_value.weight": "model-00002-of-00008.safetensors",
    "model.layers.8.input_layernorm.weight": "model-00002-of-00008.safetensors",
    "model.layers.8.mlp.language_mlp.down_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.8.mlp.language_mlp.gate_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.8.mlp.language_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.8.mlp.vision_mlp.down_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.8.mlp.vision_mlp.gate_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.8.mlp.vision_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.8.post_attention_layernorm.weight": "model-00002-of-00008.safetensors",
    "model.layers.8.self_attn.language_expert_dense.weight": "model-00002-of-00008.safetensors",
    "model.layers.8.self_attn.language_expert_query_key_value.weight": "model-00002-of-00008.safetensors",
    "model.layers.8.self_attn.rotary_emb.inv_freq": "model-00002-of-00008.safetensors",
    "model.layers.8.self_attn.vision_expert_dense.weight": "model-00002-of-00008.safetensors",
    "model.layers.8.self_attn.vision_expert_query_key_value.weight": "model-00002-of-00008.safetensors",
    "model.layers.9.input_layernorm.weight": "model-00002-of-00008.safetensors",
    "model.layers.9.mlp.language_mlp.down_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.9.mlp.language_mlp.gate_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.9.mlp.language_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.9.mlp.vision_mlp.down_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.9.mlp.vision_mlp.gate_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.9.mlp.vision_mlp.up_proj.weight": "model-00002-of-00008.safetensors",
    "model.layers.9.post_attention_layernorm.weight": "model-00002-of-00008.safetensors",
    "model.layers.9.self_attn.language_expert_dense.weight": "model-00002-of-00008.safetensors",
    "model.layers.9.self_attn.language_expert_query_key_value.weight": "model-00002-of-00008.safetensors",
    "model.layers.9.self_attn.rotary_emb.inv_freq": "model-00002-of-00008.safetensors",
    "model.layers.9.self_attn.vision_expert_dense.weight": "model-00002-of-00008.safetensors",
    "model.layers.9.self_attn.vision_expert_query_key_value.weight": "model-00002-of-00008.safetensors",
    "model.norm.weight": "model-00006-of-00008.safetensors",
    "model.vision.boi": "model-00006-of-00008.safetensors",
    "model.vision.eoi": "model-00006-of-00008.safetensors",
    "model.vision.linear_proj.dense_4h_to_h.weight": "model-00008-of-00008.safetensors",
    "model.vision.linear_proj.dense_h_to_4h.weight": "model-00008-of-00008.safetensors",
    "model.vision.linear_proj.gate_proj.weight": "model-00008-of-00008.safetensors",
    "model.vision.linear_proj.linear_proj.weight": "model-00007-of-00008.safetensors",
    "model.vision.linear_proj.norm1.bias": "model-00007-of-00008.safetensors",
    "model.vision.linear_proj.norm1.weight": "model-00007-of-00008.safetensors",
    "model.vision.patch_embedding.cls_embedding": "model-00006-of-00008.safetensors",
    "model.vision.patch_embedding.position_embedding.weight": "model-00006-of-00008.safetensors",
    "model.vision.patch_embedding.proj.bias": "model-00006-of-00008.safetensors",
    "model.vision.patch_embedding.proj.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.0.attention.dense.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.0.attention.dense.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.0.attention.query_key_value.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.0.attention.query_key_value.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.0.input_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.0.input_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.0.mlp.fc1.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.0.mlp.fc1.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.0.mlp.fc2.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.0.mlp.fc2.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.0.post_attention_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.0.post_attention_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.1.attention.dense.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.1.attention.dense.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.1.attention.query_key_value.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.1.attention.query_key_value.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.1.input_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.1.input_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.1.mlp.fc1.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.1.mlp.fc1.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.1.mlp.fc2.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.1.mlp.fc2.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.1.post_attention_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.1.post_attention_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.10.attention.dense.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.10.attention.dense.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.10.attention.query_key_value.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.10.attention.query_key_value.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.10.input_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.10.input_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.10.mlp.fc1.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.10.mlp.fc1.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.10.mlp.fc2.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.10.mlp.fc2.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.10.post_attention_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.10.post_attention_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.11.attention.dense.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.11.attention.dense.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.11.attention.query_key_value.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.11.attention.query_key_value.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.11.input_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.11.input_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.11.mlp.fc1.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.11.mlp.fc1.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.11.mlp.fc2.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.11.mlp.fc2.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.11.post_attention_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.11.post_attention_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.12.attention.dense.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.12.attention.dense.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.12.attention.query_key_value.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.12.attention.query_key_value.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.12.input_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.12.input_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.12.mlp.fc1.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.12.mlp.fc1.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.12.mlp.fc2.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.12.mlp.fc2.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.12.post_attention_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.12.post_attention_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.13.attention.dense.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.13.attention.dense.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.13.attention.query_key_value.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.13.attention.query_key_value.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.13.input_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.13.input_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.13.mlp.fc1.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.13.mlp.fc1.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.13.mlp.fc2.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.13.mlp.fc2.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.13.post_attention_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.13.post_attention_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.14.attention.dense.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.14.attention.dense.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.14.attention.query_key_value.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.14.attention.query_key_value.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.14.input_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.14.input_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.14.mlp.fc1.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.14.mlp.fc1.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.14.mlp.fc2.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.14.mlp.fc2.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.14.post_attention_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.14.post_attention_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.15.attention.dense.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.15.attention.dense.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.15.attention.query_key_value.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.15.attention.query_key_value.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.15.input_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.15.input_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.15.mlp.fc1.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.15.mlp.fc1.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.15.mlp.fc2.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.15.mlp.fc2.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.15.post_attention_layernorm.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.15.post_attention_layernorm.weight": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.16.attention.dense.bias": "model-00006-of-00008.safetensors",
    "model.vision.transformer.layers.16.attention.dense.weight": "model-00006-of-00008.safetensors",
